Artillery/getRequests.yml
config:
  # For learning purposes we are hitting the real database in development, but ideally we would be pointing the target to a test database (which would sit on another port)
  target: "http://localhost:4000"
  phases:
    - duration: 20
      arrivalRate: 250
      name: Warm up
    - duration: 30
      arrivalRate: 500
      rampTo: 50
      name: Ramp up load
    - duration: 30
      arrivalRate: 750
      name: Sustained load
  http:
    timeout: 20
  payload:
    path: "./randomProducts.csv"
    fields:
    - "product_id"

scenarios:
  - name: "Fetch all questions and answers"
    flow:
      - get:
          url: "/qa/questions?product_id={{product_id}}"